## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.cinema will be updated in-place
!   resource "helm_release" "cinema" {
        id                         = "cinema"
        name                       = "cinema"
!       status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # kubernetes_secret.mongodb-auth must be replaced
-/+ resource "kubernetes_secret" "mongodb-auth" {
!       id        = "cinema/mongodb-username" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
!           name             = "mongodb-username" -> "mongodb-auth" # forces replacement
!           resource_version = "396994" -> (known after apply)
!           uid              = "7df7aa94-684a-4c20-b729-996813b58f01" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
